rails/tweeting/app/controllers/tweets_controller.rb

def create
  @tweet = Tweet.new(params.require(:tweet).permit(:twitter, :tweet))
  if @tweet.save
---
INSERT INTO "tweets" ("twitter", "tweet", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["twitter", "dfg"], ["tweet", "dfgdfg"], ["created_at", "2020-05-12 02:28:12.874481"], ["updated_at", "2020-05-12 02:28:12.874481"]]

def destroy
  @tweet = Tweet.find params[:id]
  @tweet.destroy
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 8]]

def edit
  @tweet = Tweet.find params[:id]
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

def update
  @tweet = Tweet.find params[:id]
  if @tweet.update(params.require(:tweet).permit(:twitter, :tweet))
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tweets" SET "tweet" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["tweet", "jhbasd"], ["updated_at", "2020-05-12 02:28:21.621774"], ["id", 7]]

def show
  @tweet = Tweet.find params[:id]
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]